# 第四周作业 #

## 作业背景 #

在数据处理的步骤中，可以使用 SQL 语句或者 pandas 加 Python 库、函数等方式进行数据的清洗和处理工作。  
因此需要你能够掌握基本的 SQL 语句和 pandas 等价的语句，利用 Python 的函数高效地做聚合等操作。

作业要求：请将以下的 SQL 语句翻译成 pandas 语句：

1. `SELECT * FROM data;` 

    参考: <https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql_table.html#pandas-read-sql-table>  
    可以使用pandas的read_sql_table()这个API接口直接读取全表。  
    但是由于read_sql_table()需要依赖到`SQLAlchemy`，所以先在Linux系统中安装:  
    `pip install -i  https://mirrors.aliyun.com/pypi/simple/ sqlalchemy`

In [ ]:
# example 1
import pandas as pd

df = pd.read_sql_table('data', 'mysql+pymysql://<DB_USER>:<DB_USER_PASSWORD>@<DB_IP>/<DB_NAME>')

In [ ]:
# example 2
import pandas as pd
from sqlalchemy import Column, String, create_engine
engine = create_engine('mysql+pymysql://<DB_USER>:<DB_USER_PASSWORD>@<DB_IP>/<DB_NAME>')
df = pd.read_sql_table('maoyan_movie', engine)

2. `SELECT * FROM data LIMIT 10;`

In [ ]:
df = pd.read_sql_table('data', 'mysql+pymysql://<DB_USER>:<DB_USER_PASSWORD>@<DB_IP>/<DB_NAME>')

In [ ]:
# example 1
df.head(10)

In [ ]:
# example 2
df.iloc[:10]

3. `SELECT id FROM data;  //id 是 data 表的特定一列`

In [ ]:
# example 1
# This is a Series
df['id']

In [ ]:
# example 2
# This is a DataFrame
df.loc[:, ['title']]

4. `SELECT COUNT(id) FROM data;`

In [ ]:
df['id'].count()

5. `SELECT * FROM data WHERE id<1000 AND age>30;`

In [ ]:
df[(df.id < 1000) & (df.age > 30)]

6. `SELECT id,COUNT(DISTINCT order_id) FROM table1 GROUP BY id;`

In [ ]:
df = pd.read_sql_table('table1', 'mysql+pymysql://<DB_USER>:<DB_USER_PASSWORD>@<DB_IP>/<DB_NAME>')

df['count_distinct_order_id'] = df.groupby(['id'])['order_id'].transform('nunique')
df[ ['id', 'count_distinct_order_id'] ]

7. `SELECT * FROM table1 t1 INNER JOIN table2 t2 ON t1.id = t2.id;`

In [ ]:
df_t1 = pd.read_sql_table('table1', 'mysql+pymysql://<DB_USER>:<DB_USER_PASSWORD>@<DB_IP>/<DB_NAME>')
df_t2 = pd.read_sql_table('table2', 'mysql+pymysql://<DB_USER>:<DB_USER_PASSWORD>@<DB_IP>/<DB_NAME>')

# By default, the merge method performs an inner join.
pd.merge(df_t1, df_t2, on='id')

8. `SELECT * FROM table1 UNION SELECT * FROM table2;`

In [ ]:
pd.concat([
    df_t1, df_t2
    ], ignore_index=True).drop_duplicates().reset_index(drop=True)

9. `DELETE FROM table1 WHERE id=10;`

In [ ]:
df_t1 = df_t1[df_t1.id != 10]

10. `ALTER TABLE table1 DROP COLUMN column_name;`

In [ ]:
df_t1.drop(['column_name'], axis=1)